Tekla Open API Reference for Tekla Structures 2025
RebarGroup.RebarGroupStirrupTypeEnum Enumeration
 The different stirrup types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum RebarGroupStirrupTypeEnum
Public Enumeration RebarGroupStirrupTypeEnum
Members
Member name | Value | Description
STIRRUP_TYPE_POLYGONAL | 0 |  The polygonal type of stirrup.
STIRRUP_TYPE_SPIRAL | 1 |  The spiral type of stirrup.
STIRRUP_TYPE_TAPERED_CURVED | 2 |  The tapered curved type of stirrup. Three polygons have to be defined.
See Also
Reference
Tekla.Structures.Model Namespace